Show / Hide Table of Contents
Enum FatigueTypeOfPrestressingSteel
Posttensioned reinforcement type
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum FatigueTypeOfPrestressingSteel
Fields
 Name |  Description
 ExternalTendon
Table 6.4N: Parameters for S-N curves of prestressing steel - special type
 PostTensioningCurvedTendonsInSteelDucts
Table 6.4N: Parameters for S-N curves of prestressing steel - row 4
 PostTensioningSingleStrandsInPlasticDucts
Table 6.4N: Parameters for S-N curves of prestressing steel - row 2
 PostTensioningSplicingDevices
Table 6.4N: Parameters for S-N curves of prestressing steel - row 5
 PostTensioningStraightTendonsOrCurvedTendonsInPlasticDucts
Table 6.4N: Parameters for S-N curves of prestressing steel - row 3
 PreTensioning
Table 6.4N: Parameters for S-N curves of prestressing steel - row 1
 Improve this Doc
 View Source